########################################################################################################################
# Lavras - MG
# 08/04/2020
# Universidade Federal de Lavras - UFLA
# Departamento de Biologia
# Programa de Pós Graduação em Genética e Melhoramento de Plantas
# Disciplina: Processamento de imagens e reconhecimento de padrões no melhoramento de plantas
# Professor: Vinícius Quintão Carneiro
# E-mail: vinicius.carneiro@ufla.br
# GITHUB: vqcarneiro - https://github.com/VQCarneiro
########################################################################################################################
# PROCEDIMENTO: Rotação em imagens binárias
########################################################################################################################
# Importar pacotes
import cv2 # Importa o pacote opencv
import numpy as np # Importa o pacote numpy
from matplotlib import pyplot as plt # Importa o pacote matplotlib
########################################################################################################################
# Leitura da imagem

nome_arquivo = 'img_quadrado.png'
img = cv2.imread(nome_arquivo,0)
print('----------------------------------------------------------------------------------------------------------------')
print('IMAGEM ORIGINAL')
print('----------------------------------------------------------------------------------------------------------------')
print(img)
print('----------------------------------------------------------------------------------------------------------------')
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))
centro = (col/2,lin/2)
print("Centro: " + str(centro))
print('----------------------------------------------------------------------------------------------------------------')

########################################################################################################################
# Transformações em imagens

M_01 = cv2.getRotationMatrix2D(centro,5,1.0)
img_rt1 = cv2.warpAffine(img,M_01,(col,lin))

print('----------------------------------------------------------------------------------------------------------------')
print('ROTAÇÃO 5 GRAUS')
print('----------------------------------------------------------------------------------------------------------------')
print(img_rt1)
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img_rt1)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))

M_02 = cv2.getRotationMatrix2D(centro,10,1.0)
img_rt2 = cv2.warpAffine(img,M_02,(col,lin))
print('----------------------------------------------------------------------------------------------------------------')
print('ROTAÇÃO 10 GRAUS')
print('----------------------------------------------------------------------------------------------------------------')
print(img_rt2)
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img_rt2)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))

M_03 = cv2.getRotationMatrix2D(centro,45,1.0)
img_rt3 = cv2.warpAffine(img,M_03,(col,lin))
print('----------------------------------------------------------------------------------------------------------------')
print('ROTAÇÃO 45 GRAUS')
print('----------------------------------------------------------------------------------------------------------------')
print(img_rt3)
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img_rt3)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))

M_04 = cv2.getRotationMatrix2D(centro,90,1.0)
img_rt4 = cv2.warpAffine(img,M_04,(col,lin))
print('----------------------------------------------------------------------------------------------------------------')
print('ROTAÇÃO 90 GRAUS')
print('----------------------------------------------------------------------------------------------------------------')
print(img_rt4)
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img_rt4)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))

M_05 = cv2.getRotationMatrix2D(centro,180,1.0)
img_rt5 = cv2.warpAffine(img,M_05,(col,lin))
print('----------------------------------------------------------------------------------------------------------------')
print('ROTAÇÃO 180 GRAUS')
print('----------------------------------------------------------------------------------------------------------------')
print(img_rt5)
print('----------------------------------------------------------------------------------------------------------------')
print('INFORMAÇÕES')
print('----------------------------------------------------------------------------------------------------------------')
lin, col = np.shape(img_rt5)
print('Dimensão: ' + str(lin) +' x '+ str(col))
print('Largura: ' + str(col))
print('Altura: ' + str(lin))
print('----------------------------------------------------------------------------------------------------------------')
########################################################################################################################
# Apresentar imagens

# Imagem Em RGB
plt.figure('TRANSLAÇÃO')
plt.subplot(2,3,1)
plt.imshow(img,cmap="gray")
plt.title("ORIGINAL")

plt.subplot(2,3,2)
plt.imshow(img_rt1,cmap="gray")
plt.title("5")

plt.subplot(2,3,3)
plt.imshow(img_rt2,cmap="gray")
plt.title("10")

plt.subplot(2,3,4)
plt.imshow(img_rt3,cmap="gray")
plt.title("45")

plt.subplot(2,3,5)
plt.imshow(img_rt4,cmap="gray")
plt.title("90")

plt.subplot(2,3,6)
plt.imshow(img_rt5,cmap="gray")
plt.title("180")

plt.show()
########################################################################################################################